#handling missing values-3

#dropna() method it removes row if it contain NaN values by default axis=0

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\practice.csv')
df

   A   B    C  D    E
0  1  12  9.0  4  2.0
1  2  23  8.0  3  3.0
2  3  34  NaN  2  4.0
3  4  45  NaN  1  NaN
4  5  56  5.0  0  7.0

In [4]:
df.dropna()

   A   B    C  D    E
0  1  12  9.0  4  2.0
1  2  23  8.0  3  3.0
4  5  56  5.0  0  7.0

In [5]:
df.dropna(axis=0)

   A   B    C  D    E
0  1  12  9.0  4  2.0
1  2  23  8.0  3  3.0
4  5  56  5.0  0  7.0

In [6]:
df.dropna(axis=1)

   A   B  D
0  1  12  4
1  2  23  3
2  3  34  2
3  4  45  1
4  5  56  0

#df.dropna(how='any')...similar like df.dropna()

In [7]:
df.dropna(how='any')

   A   B    C  D    E
0  1  12  9.0  4  2.0
1  2  23  8.0  3  3.0
4  5  56  5.0  0  7.0

In [8]:
df.dropna(how='any',axis=1)  #df.dropna(axis=1)

   A   B  D
0  1  12  4
1  2  23  3
2  3  34  2
3  4  45  1
4  5  56  0

#df.dropna(how='all')...if rows contain all null values then it can deop that row

In [11]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\practice.csv')
df

     A     B    C    D    E
0  1.0  12.0  9.0  4.0  2.0
1  2.0  23.0  8.0  3.0  3.0
2  3.0  34.0  NaN  2.0  4.0
3  4.0  45.0  NaN  1.0  NaN
4  NaN   NaN  NaN  NaN  NaN

In [12]:
df.dropna(how='all')

     A     B    C    D    E
0  1.0  12.0  9.0  4.0  2.0
1  2.0  23.0  8.0  3.0  3.0
2  3.0  34.0  NaN  2.0  4.0
3  4.0  45.0  NaN  1.0  NaN

#thresh()..it print bydefault rows having value at least one not a null value

In [13]:
df.dropna(thresh=1)
#having atlest one not null value

     A     B    C    D    E
0  1.0  12.0  9.0  4.0  2.0
1  2.0  23.0  8.0  3.0  3.0
2  3.0  34.0  NaN  2.0  4.0
3  4.0  45.0  NaN  1.0  NaN

In [14]:
df.dropna(thresh=4)

     A     B    C    D    E
0  1.0  12.0  9.0  4.0  2.0
1  2.0  23.0  8.0  3.0  3.0
2  3.0  34.0  NaN  2.0  4.0

#subset()...drop a column having having NaN value

In [15]:
df

     A     B    C    D    E
0  1.0  12.0  9.0  4.0  2.0
1  2.0  23.0  8.0  3.0  3.0
2  3.0  34.0  NaN  2.0  4.0
3  4.0  45.0  NaN  1.0  NaN
4  NaN   NaN  NaN  NaN  NaN

In [19]:
df.dropna(subset=["C"])

     A     B    C    D    E
0  1.0  12.0  9.0  4.0  2.0
1  2.0  23.0  8.0  3.0  3.0

 #inplace()..drop rows containing non values rows ..it does not create seprate dataframe it modify in current dataframe.

In [24]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\practice.csv')
df

     A     B    C    D    E
0  1.0  12.0  9.0  4.0  2.0
1  2.0  23.0  8.0  3.0  3.0
2  3.0  34.0  NaN  2.0  4.0
3  4.0  45.0  NaN  1.0  NaN
4  NaN   NaN  NaN  NaN  NaN

In [25]:
df.dropna(inplace=True)
df

     A     B    C    D    E
0  1.0  12.0  9.0  4.0  2.0
1  2.0  23.0  8.0  3.0  3.0